[
{
  "model": "games.games",
  "pk": 1,
  "fields": {
    "name": "God Of War",
    "image": "https://www.mobygames.com/images/covers/l/474565-god-of-war-playstation-4-front-cover.png",
    "price": 49.99,
    "platform": "PS4",
    "genre": "Action",
    "full_game": "Full Game",
    "game_info": "Skinhead-demigod-anger-golem is a terrible father - becomes a good father by application of sternness and dismemberment. Many years after Kratos defeated the Olympian gods,[e] he now lives with his son Atreus in ancient Scandinavia in the realm of Midgard. After cremating the body of his wife, Faye, and after a short hunting/survival lesson with Atreus, Kratos is confronted by a mysterious stranger with godlike power and invulnerability. The two battle and Kratos seemingly kills the stranger, after which Kratos and Atreus begin their journey to honor Faye's last wish: to scatter her ashes at the highest peak in the nine realms.  Reaching the Lake of the Nine, the pair encounter the friendly World Serpent, Jörmungandr, the last remaining Giant. When they find their path blocked by impenetrable black mist, the Witch of the Woods appears and instructs them to use the Bifröst to travel to Alfheim and secure its Light to extinguish the mist. Successful, they reach Midgard's peak and overhear a conversation between the mysterious stranger — revealed to be Baldur — his nephews Magni and Modi, and the imprisoned Mímir. After they leave, Kratos and Atreus confront Mímir, who reveals that the highest peak is in Jötunheim, but the Giants have blocked travel there to keep out Odin and Thor. Knowing of another passage, Mímir instructs Kratos to behead him and have his head revived by the Witch of the Woods, whom he reveals to be Freya upon resurrection. Kratos' longstanding hatred of gods causes him to immediately distrust her, but both Freya and Mímir warn him that he must tell Atreus about his true nature.",
    "size": 44.9,
    "release_date": "2018-04-20",
    "developer": "Santa Monica Studio",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 2,
  "fields": {
    "name": "Dishonoured 2",
    "image": "https://s1.gaming-cdn.com/images/products/861/271x377/game-steam-dishonored-2-cover.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Stealth Action",
    "full_game": "Full Game",
    "game_info": "Sneak around and dont stab people or run around and stab people - more stabbing = more rats, less stabbing = less rats. Favourable rats:stabbing conversion rate. Fifteen years after Corvo Attano restored Emily Kaldwin to the throne following the assassination of her mother, Dunwall has prospered under her reign. A serial killer known as \"the Crown Killer\" has been murdering Emily's enemies, leading many to believe that Emily and Corvo are responsible. During a ceremony in remembrance of Jessamine Kaldwin's assassination, Duke Luca Abele of Serkonos arrives with the witch Delilah Copperspoon. Delilah claims to be Jessamine's half-sister and the true heir to the throne. The Duke's men attack, killing Emily's men. The player then chooses whether to continue as Emily or Corvo, and the character not chosen is magically turned to stone by Delilah. The player escapes to the Dunwall docks, where Meagan Foster is waiting. Meagan was sent by Anton Sokolov to warn Emily and Corvo about the Duke's coup. They sail for Karnaca, where Delilah began her rise to power. During the voyage, the player is visited by the Outsider, who offers them supernatural powers and instructs them to stop Delilah.",
    "size": 35.99,
    "release_date": "2016-11-11",
    "developer": "Arkane Studios",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 3,
  "fields": {
    "name": "Divinity Original Sin II",
    "image": "https://www.mobygames.com/images/covers/l/503947-divinity-original-sin-ii-definitive-edition-playstation-4-front-cover.png",
    "price": 29.99,
    "platform": "PS4",
    "genre": "RPG",
    "full_game": "Full Game",
    "game_info": "You can launch flaming boulders at dwarves. I've never played a game that lets you do that. I love everything about it; the flames, the boulder, the satisfying crunch of flaming boulder on dwarf. Also some grand fantasy narrative about the end of the world idk I wasn't really listening because of all the flaming boulder dwarf launching. he game is set on the fantasy world of Rivellon, centuries after Divinity: Original Sin. Living beings on Rivellon have a form of energy known as Source, and individuals called Sourcerers can manipulate Source to cast spells or enhance their combat abilities. The Seven Gods of Rivellon had given up a portion of their collective Source power and infused it into a person, Lucian, known as the Divine, who used his powers to hold back the Void. However, Lucian died before the start of the game, which weakened the Veil between the Void and Rivellon, and monstrous creatures of the Void, guided by the God King, their dark deity, have begun to invade Rivellon. These Voidwoken are drawn to the use of Source, and so an organization called the Divine Order is persecuting Sourcerers.",
    "size": 50.0,
    "release_date": "2017-11-09",
    "developer": "Larian Studios",
    "rating": "https://www.esrb.org/wp-content/uploads/2019/04/Category.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 4,
  "fields": {
    "name": "Bloodborne",
    "image": "https://assets1.ignimgs.com/2019/01/05/bloodborne---button-1546669457774.jpg?width=188",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Action",
    "full_game": "Full Game",
    "game_info": "retelling of the popular tale of an insomniac goth becomes a squid monster and ascends to a higher cosmic plane. Bloodborne takes place in Yharnam, a decrepit Gothic city known for its medical advances around the practice of blood ministration.[37] Over the years, many travellers journey to the city seeking the remedy to cure their afflictions; the player's character journeys to Yharnam seeking the cure, something known as Paleblood, for an unspecified illness.[37] However, upon arriving in the city, it is discovered that Yharnam is plagued with an endemic illness that has transformed most of its citizens into bestial creatures. The player must navigate the streets of Yharnam during the night of The Hunt and overcome its violently deranged inhabitants and horrifying monsters to stop the source of the plague and escape the Nightmare.[38][39] Long ago, the residents of Yharnam began worshipping ancient, eldritch cosmic beings known as the Great Ones after scholars from the College of Byrgenwerth discovered something referred to as a \"medium\" in the ruins of an ancient, highly advanced civilization, on top of which Yharnam was built. The Great Ones provided the healing blood Yharnam was famous for, which is also the source of the plague.",
    "size": 50.5,
    "release_date": "2015-05-19",
    "developer": "FROM Software",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 5,
  "fields": {
    "name": "Hollow Knight",
    "image": "https://image.api.playstation.com/cdn/UP1822/CUSA13632_00/GuFQKWlrIVODEA1su20fCOrNZEYX5CB9.png",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Platformer",
    "full_game": "Full Game",
    "game_info": "Sad bugs, hard bosses and the greatest sitting on benches mechanic ever implemented. Atmosphere is immense and also the way Cornifer hums to himself is adorbs. At the outset of the game, the Knight (the player character) arrives at the ruined remains of Hallownest, a vast, ancient kingdom just below a grubby town called Dirtmouth. As the Knight ventures through the ruins, they discover that Hallownest was once a flourishing kingdom which fell to ruin after becoming overrun with \"The Infection\", which drove its citizens to madness and undeath. The first and last ruler of Hallownest, the Pale King, attempted to seal away the Infection; however, it becomes increasingly clear that the seal is failing. The knight's mission is to find and kill the three Dreamers who act as living locks to the seal. This quest brings the Knight into conflict with Hornet, a warrior who acts as the protector of Hallownest who tests the Knight's resolve in several battles.  Through dialogue with certain characters as well as cutscenes, the Knight receives insight into the origin of the Infection and itself. In ancient times, some of the bugs of Hallownest worshipped a higher being called the Radiance: a primordial, mothlike creature whose mere presence could sway the denizens of Hallownest to mindless obedience. One day, another higher being named The Pale King arrived at Hallownest and used his power to \"free\" the minds of the bugs of Hallownest, granting them sapience.",
    "size": 10.0,
    "release_date": "2015-05-19",
    "developer": "Team Cherry",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 6,
  "fields": {
    "name": "Marvel's Spider-Man",
    "image": "https://howlongtobeat.com/games/70093_Marvels_Spider-Man_Game_of_the_Year_Edition.jpg",
    "price": 49.99,
    "platform": "PS4",
    "genre": "Action Adventure",
    "full_game": "Full Game",
    "game_info": "Marvel's Spider-Man[a] is a 2018 action-adventure game developed by Insomniac Games and published by Sony Interactive Entertainment. Based on the Marvel Comics character Spider-Man, it tells an original narrative that is inspired by the long-running comic book mythology, while also drawing from various adaptations in other media. In the main story, the super-human crime lord Mister Negative orchestrates a plot to seize control of New York City's criminal underworld. When Mister Negative threatens to release a deadly virus, Spider-Man must confront him and protect the city while dealing with the personal problems of his civilian persona, Peter Parker.  Gameplay is presented from the third-person perspective with a primary focus on Spider-Man's traversal and combat abilities. Spider-Man can freely move around New York City, interacting with characters, undertaking missions, and unlocking new gadgets and suits by progressing through the main story or completing tasks. Outside the story, the player is able to complete side missions to unlock additional content and collectible items. Combat focuses on chaining attacks together and using the environment and webs to incapacitate numerous foes while avoiding damage.",
    "size": 60.4,
    "release_date": "2018-07-09",
    "developer": "Insomniac Games",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 7,
  "fields": {
    "name": "Ghost of Tsushima",
    "image": "https://upload.wikimedia.org/wikipedia/en/b/b6/Ghost_of_Tsushima.jpg",
    "price": 69.99,
    "platform": "PS4",
    "genre": "Action Adventure",
    "full_game": "Full Game",
    "game_info": "n 1274, a Mongol fleet led by Khotun Khan invades the Japanese island of Tsushima. Local samurai Lord Jin Sakai and his uncle Lord Shimura lead the island’s samurai in an attempt to repel the invaders. However, the battle ends in disaster, with the samurai killed, Shimura captured, and Jin severely wounded and left for dead. He is found and revived by Yuna, a thief, who informs him the island has fallen. Jin storms Khotun's stronghold at Castle Kaneda in an attempt to rescue Shimura, but is defeated by Khotun in combat and thrown off the castle bridge, though he survives.  Realizing he cannot defeat the Mongols alone or with traditional samurai tactics, Jin travels throughout the island to recruit allies and learns guerilla warfare. He recruits Yuna, her blacksmith brother Taka, merchant Kenji, master archer Sadanobu Ishikawa, female samurai Masako Adachi, and his old friend mercenary Ryuzo and his Straw Hat rōnin. As Jin disrupts Mongol activities and liberates villages across the island, the people begin to revere to him as \"The Ghost\", a samurai spirit risen against the Mongols. Taka crafts a grappling hook for Jin to scale Castle Kaneda’s walls, and Jin strikes with his allies. Destitute and starving, Ryuzo and the Straw Hats betray Jin to collect the bounty issued on him by Khotun. Jin manages to fend them off, free Shimura and retake Castle Kaneda. Despite their victory, Khotun has already left to conquer Castle Shimura alongside Ryuzo.",
    "size": 70.0,
    "release_date": "2020-07-17",
    "developer": "Sucker Punch Productions",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 8,
  "fields": {
    "name": "Subnautica",
    "image": "https://upload.wikimedia.org/wikipedia/en/6/6d/Subnautica_cover_art.png",
    "price": 29.99,
    "platform": "PS4",
    "genre": "Action",
    "full_game": "Full Game",
    "game_info": "Subnautica takes place in a distant future, when humanity begins to colonize other star systems. The Aurora, a deep-space vessel constructed by the Alterra Corporation, has been sent to a system at the outer reaches of known space on its maiden voyage, specifically an area called the Ariadne Arm. Its primary mission is to build a section of high-speed space travel infrastructure known as a Phasegate in the Ariadne Arm. However, its secondary mission, unknown to most of the crew, is to search for and, possibly, rescue the crew of a ship called the Degasi, which crashed on planet 4546B ten years prior. After the Aurora enters orbit of 4546B, it is physically waylaid by a mysterious energy-pulse and crash-lands on the planet. Several crew members climb into lifepods and jettison from the Aurora during the descent, one of whom is Ryley Robinson, the player character. The other lifepods' inhabitants perish through various means, leaving Ryley as the lone survivor. Ryley finds records of the Degasi's crew stating that only three survived the initial crash, but later two out of the three are confirmed dead and one is presumed dead.",
    "size": 30.46,
    "release_date": "2018-12-04",
    "developer": "Unknown Worlds Entertainment, Inc.",
    "rating": "https://image.api.playstation.com/grc/images/ratings/hd/esrb/e10.png?w=180&thumb=false",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 9,
  "fields": {
    "name": "Cyberpunk 2077",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/9f/Cyberpunk_2077_box_art.jpg",
    "price": 49.99,
    "platform": "PS4",
    "genre": "Action",
    "full_game": "Unfinished",
    "game_info": "Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol. Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lolRemember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.Remember when CD Projekt Red was good lol.",
    "size": 80.56,
    "release_date": "2020-12-10",
    "developer": "CD Projekt Red",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/440px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 10,
  "fields": {
    "name": "Mortal Kombat 11",
    "image": "https://upload.wikimedia.org/wikipedia/en/7/7e/Mortal_Kombat_11_cover_art.png",
    "price": 29.99,
    "platform": "PS4",
    "genre": "Fighting",
    "full_game": "Full Game",
    "game_info": "The OG 90s gratuitous-to-the-point-of-being-comical murder simulator, resurrected with surpsingly solid mechanics and story mode. All from a franchise made famous for letting you morph into a dragon and bite ninjas in half. Inspiring stuff. Mortal Kombat X is a fighting game in which two characters fight against each other using a variety of attacks, including special moves, and the series' trademark gruesome finishing moves. The game allows two players to face each other (either locally or online), or a single player to play against the CPU. The energy meter, first introduced in Mortal Kombat (2011), allows players to perform techniques such as \"X-Ray\" special moves. Similarly to NetherRealm Studios' previous title, Injustice: Gods Among Us, fighters are able to interact with the environment, using parts of the scenery to reposition themselves or using available objects as weapons.[4] In addition, each fighter has three different variations, each featuring a different set of moves they can use during the fight: for example, the character Scorpion features a Ninjutsu variation which gives him specific moves utilizing dual swords, a Hellfire variation which incorporates fiery special moves, and an Inferno variation which allows him to summon hellspawn minions to aid him in the fight.",
    "size": 50.23,
    "release_date": "2020-11-17",
    "developer": "NetherRealm Studios",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/440px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 11,
  "fields": {
    "name": "Horizon Zero Dawn",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/93/Horizon_Zero_Dawn.jpg",
    "price": 49.99,
    "platform": "PS4",
    "genre": "Action",
    "full_game": "Full Game",
    "game_info": "The story is set in post apocalyptic United States in the 31st century, humans live in scattered tribal-like populations with limited access to technology. Their technologically advanced predecessors are remembered as the \"Old Ones\". Large robotic creatures, known as \"machines\", dominate the Earth. For the most part, they peacefully coexist with humans, who occasionally hunt them for parts. However, a phenomenon known as the \"Derangement\" has caused machines to become more aggressive towards humans, and larger and deadlier machines have begun to appear. There are four tribes that are prominently featured: the Nora, the Carja, the Banuk, and the Oseram. The Nora are fierce hunter-gatherers who live in the mountains and worship nature as the \"All-Mother\". The Carja are desert-dwelling city builders who worship the Sun. The Banuk consists of hunters and shamans who live in snowy mountains and adore the machines. The Oseram are tinkerers known for their metalworking, brewing, and arguing.",
    "size": 50.9,
    "release_date": "2017-02-28",
    "developer": "Guerrilla Games",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/440px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 12,
  "fields": {
    "name": "Monster Hunter: World",
    "image": "https://upload.wikimedia.org/wikipedia/en/1/1b/Monster_Hunter_World_cover_art.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "RPG",
    "full_game": "Full Game",
    "game_info": "Buy gear, hunt monsters, kill monsters, loot monsters, make new gear with the loot which you go and hunt monsters with. Repeat forever. Oh and cute cats wearing outfits. It's the best. Monster Hunter: World is an action role-playing game played from a third-person perspective. Similar to previous games in the series, the player takes the role of a player-created character who travels to the \"New World\", an unpopulated landmass filled with monsters, to join the Research Commission that studies the land from their central command base of Astera. The Research Commission tasks the Hunter to hunt down and either kill or capture large monsters that roam outside Astera to both protect the Commission and to study the monsters there.[1] The player's character does not have any intrinsic attributes, but instead these are determined by what equipment the character is equipped with. This includes a weapon, selected from the series' fourteen archetypes (such as long sword, bow, or hammer),[2] which then further defines the types of combat moves and abilities the player can use, and pieces of armor, which can lead to beneficial or detrimental combat skills if matched properly. While some basic equipment can be purchased using in-game money, most equipment is built from loot obtained by slaying or trapping monsters, rewards from completing quests, or items gathered while in the field.",
    "size": 45.45,
    "release_date": "2018-01-26",
    "developer": "Capcom",
    "rating": "https://compass-ssl.xbox.com/assets/35/ee/35eef92e-13d8-407d-905c-294e25988f4f.svg?n=ESRB-T_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 13,
  "fields": {
    "name": "Prey",
    "image": "https://upload.wikimedia.org/wikipedia/en/2/29/Prey_cover_art.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Action",
    "full_game": "Full Game",
    "game_info": "Prey takes place in an alternate timeline that resulted in an accelerated Space Race and humankind taking to orbital stations far earlier. The player controls Morgan Yu while exploring the space station Talos I, in orbit around Earth–Moon L2, where they were part of a scientific team researching the Typhon, a hostile alien force composed of many forms with both physical and psychic powers, such as shapeshifting into a clone of any inanimate object. As the Typhon escape confinement, the player uses a variety of weapons and abilities derived from the Typhon to avoid being killed while looking to escape the station. The player gains access to areas of the station by acquiring key items and abilities, eventually allowing the player to explore the station in an open world setting. The game combines elements of role-playing video games, stealth games, immersive sims and Metroidvanias in its design.",
    "size": 45.0,
    "release_date": "2017-05-05",
    "developer": "Arkane Studios",
    "rating": "https://compass-ssl.xbox.com/assets/88/d4/88d43eac-89d7-43c8-8aa7-eb67b02595c5.svg?n=ESRB-Mature_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 14,
  "fields": {
    "name": "Dark Souls III",
    "image": "https://gameskeys-net.b-cdn.net/wp-content/uploads/2020/04/5a5c8018ae653a157a058935.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Action",
    "full_game": "Full Game",
    "game_info": "Set in the Kingdom of Lothric, a bell has rung to signal that the First Flame, responsible for maintaining the Age of Fire, is dying out. As has happened many times before, the coming of the Age of Dark produces the undead: cursed beings that rise after death. The Age of Fire can be prolonged with the linking of the fire, a ritual in which great lords and heroes sacrifice their souls to rekindle the First Flame. However, Prince Lothric, the chosen linker for this age, abandoned his duty and watched the flame die from afar. The bell is the last hope for the Age of Fire, resurrecting previous Lords of Cinder (heroes who linked the flame in past ages) to attempt to link the fire again; however, all but one Lord shirk their duty. Meanwhile, Sulyvahn, a sorcerer from the Painted World of Ariandel, wrongfully proclaims himself Pontiff and seizes power over Irithyll of the Boreal Valley and the returning Anor Londo cathedral from Dark Souls as a tyrant. The Ashen One, an Undead who failed to become a Lord of Cinder and thus called an Unkindled, rises and must link the fire by returning Prince Lothric and the defiant Lords of Cinder to their thrones in Firelink Shrine. The Lords include the Abyss Watchers, a legion of warriors, sworn by the Old Wolf's Blood which linked their souls into one, to protect the land from the Abyss, and were ultimately locked in an endless battle between each other; Yhorm the Giant, who was once a conqueror of the very people for whom he then sacrificed his life; and Aldrich, who became a Lord of Cinder despite his ravenous appetite for both men and gods. Lothric himself was raised to link the First Flame, but rejected his destiny and chose to watch the fire fade.",
    "size": 65.6,
    "release_date": "2016-03-24",
    "developer": "From Software",
    "rating": "https://compass-ssl.xbox.com/assets/88/d4/88d43eac-89d7-43c8-8aa7-eb67b02595c5.svg?n=ESRB-Mature_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 15,
  "fields": {
    "name": "Call of Duty: Modern Warfare",
    "image": "https://upload.wikimedia.org/wikipedia/en/e/e9/CallofDutyModernWarfare%282019%29.jpg",
    "price": 49.99,
    "platform": "PS4",
    "genre": "First-Person Shooter",
    "full_game": "Full Game",
    "game_info": "Modern Warfare is a first-person shooter game. Its single-player campaign focuses on realism and features tactically-based moral choices whereupon the player is evaluated and assigned a score at the end of each level; players have to quickly ascertain whether NPCs are a threat or not, such as a civilian woman who is believed to be reaching for a gun, but then simply grabs her baby from a crib. This collateral damage score, referred to as a threat assessment, is based on how many civilians the player injures or kills and ranges from rank A to F. Rewards are introduced to those who score higher.[6] Character dialogue will differ depending on the choices the player makes in the game.[7] Tactical decisions are also included, such as the player using a sniper rifle in a large environment to approach objectives in a non-linear order, and choosing to shoot out lights in favor of using night-vision goggles during breaching and clearing. The game's multiplayer has been revised from its predecessors to allow for a more tactical gameplay style, including a focus on map exploration, door breaching, and a Hardcore \"Realism\" mode that removes the HUD. The mini-map was originally removed in favor of a compass-style marker, with visual cues to detect friendlies and opponents. Following feedback from the multiplayer beta test, Infinity Ward re-implemented the mini-map but removed the appearance of red dots representing enemy players (except for when the UAV killstreak is used). Multiplayer also features the return of Killstreaks (rewards based on kills), with more recent Call of Duty titles having used Scorestreaks (rewards based on score) instead. Killstreaks can, however, be converted into Scorestreaks with the use of an in-game perk called \"Pointman\". The online modes allow for a larger range of players within a map than previous installments, with a new mode called \"Ground War\" featuring over 100 players.",
    "size": 70.63,
    "release_date": "2019-10-25",
    "developer": "Infinity Ward",
    "rating": "https://compass-ssl.xbox.com/assets/88/d4/88d43eac-89d7-43c8-8aa7-eb67b02595c5.svg?n=ESRB-Mature_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 16,
  "fields": {
    "name": "Sekiro: Shadows Die Twice",
    "image": "https://upload.wikimedia.org/wikipedia/en/6/6e/Sekiro_art.jpg",
    "price": 29.99,
    "platform": "PS4",
    "genre": "Stealth Action",
    "full_game": "Full Game",
    "game_info": "In 17th century Japan, following the Sengoku period, warlord Isshin Ashina stages a coup to seize control of the land of Ashina.[1] During this time, a nameless orphan is adopted by the wandering shinobi named Ukonzaemon Usui, known to many as \"Owl\", who named the boy \"Wolf\" and trained him in the ways of the shinobi. Two decades later, Ashina is on the brink of collapse due to the now elderly Isshin falling ill and the Interior Ministry, a group set on unifying Japan, steadily closing in. Desperate to save his clan, Isshin's adoptive grandson Genichiro seeks the immortal \"Divine Heir\" Kuro in hopes of using \"Dragon Heritage\" in his blood to create an immortal army. Wolf, now a full-fledged shinobi and Kuro's personal bodyguard, fights him but loses the duel along with his left arm while Genichiro takes the boy.  Having received Kuro's blood, Wolf survives and is brought to an abandoned temple to recuperate by a Sculptor, a former shinobi known as Sekijo, who now carves Buddha statues. Armed with a Shinobi Prosthetic,[3][8][9] Wolf assaults Ashina Castle and confronts Genichiro again, defeating him. However, Genichiro survives as he drank the \"Rejuvenating Waters\", an artificial replication of the Dragon Heritage. As Wolf rescues Kuro, the two are given the opportunity to flee Ashina forever. However, Kuro instead decides to stay and perform the \"Immortal Severance\" ritual, which would remove his Dragon Heritage and prevent anybody else from fighting over him to obtain immortality. Wolf reluctantly agrees to help and sets out to collect the necessary materials for the ritual, including a special sword that can kill immortals known as the Mortal Blade, which is safeguarded by the immortal \"Child of the Rejuvenating Waters\", the only survivor from an experiment with the Rejuvenating Waters. Wolf crosses paths with Isshin Ashina during his quest, who gives him a new name: \"Sekiro\", the \"one-armed wolf\".",
    "size": 65.23,
    "release_date": "2019-03-22",
    "developer": "From Software",
    "rating": "https://compass-ssl.xbox.com/assets/88/d4/88d43eac-89d7-43c8-8aa7-eb67b02595c5.svg?n=ESRB-Mature_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 17,
  "fields": {
    "name": "Doom Eternal",
    "image": "https://upload.wikimedia.org/wikipedia/en/9/9d/Cover_Art_of_Doom_Eternal.png",
    "price": 49.99,
    "platform": "ps4",
    "genre": "First-Person Shooter",
    "full_game": "Full Game",
    "game_info": "Local man literally too angry to die. Players once again take on the role of the Doom Slayer who battles the demonic forces of Hell, from a first-person perspective. The game continues its predecessor's emphasis on \"push-forward\" combat, encouraging the player to aggressively engage enemies in order to acquire health, ammo, and armor. The player has access to various firearms, such as the Combat Shotgun, Super Shotgun, Heavy Cannon, Rocket Launcher, Plasma Rifle, Chaingun, BFG 9000, and Ballista. Melee weapons such as a chainsaw, the \"Crucible Blade\" energy sword, the Sentinel Argent Hammer, and a retractable arm-blade called the \"Doomblade\" can also be used. The arm-blade provides the opportunity for a larger variety of quick and violent \"glory kill\" executions, which drop extra health. The Super Shotgun is now equipped with the \"Meat Hook\", a ranged accessory which grabs on to enemies and slingshots the player towards them, functioning as a grappling hook, useful both in combat scenarios and environmental navigation. The Doom Slayer's armor now includes a shoulder-mounted Equipment Launcher with the ability to lob grenades and ice bombs.",
    "size": 666.0,
    "release_date": "2021-07-29",
    "developer": "id Software",
    "rating": "https://compass-ssl.xbox.com/assets/88/d4/88d43eac-89d7-43c8-8aa7-eb67b02595c5.svg?n=ESRB-Mature_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 18,
  "fields": {
    "name": "DOOM",
    "image": "https://upload.wikimedia.org/wikipedia/en/2/28/Doom_Cover.jpg",
    "price": 15.99,
    "platform": "PS4",
    "genre": "First-Person Shooter",
    "full_game": "Full Game",
    "game_info": "Doom is a 2016 first-person shooter game developed by id Software and published by Bethesda Softworks. It is the first major installment in the series since Doom 3 (2004). Players take the role of an unnamed space marine, known as the Doom Slayer, as he battles demonic forces from Hell that have been unleashed by the Union Aerospace Corporation within their energy-mining facility on Mars. The gameplay returns to a faster pace with more open-ended levels, closer to the first two games than the slower survival horror approach of Doom 3. It also features environment traversal, character upgrades, and the ability to perform executions known as \"glory kills\".  Doom was announced as Doom 4 in 2008, and that version underwent an extensive development cycle with different builds and designs before the game was restarted in 2011 and revealed as simply Doom in 2014. It was tested by customers who pre-ordered the 2014 Bethesda game Wolfenstein: The New Order and also by the general public. Mick Gordon composed the music for the game, with additional music contributed by Ben F. Carney, Chris Hite, and Chad Mossholder.",
    "size": 666.0,
    "release_date": "2016-02-05",
    "developer": "id Software",
    "rating": "https://compass-ssl.xbox.com/assets/88/d4/88d43eac-89d7-43c8-8aa7-eb67b02595c5.svg?n=ESRB-Mature_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 19,
  "fields": {
    "name": "XCOM 2: War Of The Chosen",
    "image": "https://upload.wikimedia.org/wikipedia/en/c/c3/XCOM_2_cover_art.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Strategy",
    "full_game": "Full Game",
    "game_info": "XCOM 2 is a 2016 turn-based tactics video game developed by Firaxis Games and published by 2K Games. It is the sequel to 2012's reboot of the series, XCOM: Enemy Unknown; it takes place 20 years after the events of Enemy Unknown. XCOM, a military organization trying to fight off an alien invasion, has lost the war and is now a resistance force against the occupation of Earth and the established totalitarian regime and military dictatorship. Gameplay is split between turn-based combat in which players command a squad of soldiers to fight enemies, and strategy elements in which players manage and control the operations of the Avenger, an alien ship that is used as a mobile base for XCOM. Players take control of the Avenger, an alien ship that is the new mobile base for XCOM, commanding the engineering and research departments of the base between missions.[22] Players can assign the research department to perform autopsies on alien corpses and study the technology found during missions,[23] which unlock new gadgets, weapons and technologies to assist players in battle.[24] The engineering department can be instructed to craft new ammo types, armors, and weapons. The Armory[4] allows players to recruit soldiers and customize their personalities, names, costumes, genders, nationalities, and weapons.[20][25] Wounded soldiers will slowly convalesce at the base.[26] As the game progresses, new facilities that allow players to increase squad size, improve combat performance, and craft experimental weapons are unlocked.",
    "size": 50.55,
    "release_date": "2016-03-24",
    "developer": "Firaxis Games",
    "rating": "https://compass-ssl.xbox.com/assets/35/ee/35eef92e-13d8-407d-905c-294e25988f4f.svg?n=ESRB-T_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 20,
  "fields": {
    "name": "X-COM Enemy Uknown",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/f/fd/XCOM_Enemy_Unknown_Game_Cover.jpg/220px-XCOM_Enemy_Unknown_Game_Cover.jpg",
    "price": 15.99,
    "platform": "PS4",
    "genre": "Strategy",
    "full_game": "Full Game",
    "game_info": "After success with shooting down alien scout ships and securing the crash sites from surviving alien crews, as well as interdicting alien attempts to abduct human civilians for unknown purposes, XCOM manages to also obtain the corpses of various different alien troops. Autopsies reveal that all these types have been genetically and/or cybernetically altered, which seems to indicate they are merely foot-soldiers for unseen leaders. XCOM's head of research, Dr. Vahlen, requests that a live alien be captured for interrogation. This also involves developing a specialized weapon capable of capturing a live alien, and constructing a facility in XCOM's subterranean base capable of safely holding a live alien prisoner.[30]  Capturing one of the alien troops and conducting the interrogation reveals vague information about another type of alien called the Outsiders, artificially-created crystalline beings encountered aboard UFOs, that appear to serve as pilots and navigators. Dr. Vahlen then requests that XCOM capture an Outsider for study. Upon capturing one of these, the examination reveals that the Outsiders' exotic crystalline structures behave in a manner similar to antennas, receiving a signal broadcast from a location buried underground on Earth. XCOM dispatches a team to investigate the signal; it is found to be coming from a base that the aliens have secretly established on Earth, where experiments are performed on abducted humans",
    "size": 56.35,
    "release_date": "2013-05-12",
    "developer": "Firaxis Games",
    "rating": "https://compass-ssl.xbox.com/assets/35/ee/35eef92e-13d8-407d-905c-294e25988f4f.svg?n=ESRB-T_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 21,
  "fields": {
    "name": "Resident Evil 2",
    "image": "https://upload.wikimedia.org/wikipedia/en/f/fd/Resident_Evil_2_Remake.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Action, Survival Horror",
    "full_game": "Full Game",
    "game_info": "The game is set in Raccoon City in September 1998, two months after the events of Resident Evil. Most of the citizens have been turned into mindless zombies, due to an outbreak of a viral bioweapon known as the T-virus, manufactured by Umbrella Corporation.[2][3] The game begins at a gas station outside of the city, where rookie police officer Leon S. Kennedy (Nick Apostolides) meets college student Claire Redfield (Stephanie Panisello), who is looking for her brother Chris.  After being separated following a car accident, Leon and Claire agree to meet up at the city's police department. The building is infested by zombies, and other monsters, including the \"Tyrant\",[b] who is dispatched to hunt down and kill any survivors. The creatures and various obstacles prevent Leon and Claire from actually reuniting as they are forced to find a way to escape the city. Leon and Claire will arrive at the station at different times depending on the scenario.",
    "size": 45.21,
    "release_date": "2018-11-22",
    "developer": "Capcom",
    "rating": "https://compass-ssl.xbox.com/assets/88/d4/88d43eac-89d7-43c8-8aa7-eb67b02595c5.svg?n=ESRB-Mature_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 22,
  "fields": {
    "name": "Amnesia: The Dark Descent",
    "image": "https://www.mobygames.com/images/covers/l/289473-amnesia-the-dark-descent-linux-front-cover.jpg",
    "price": 15.99,
    "platform": "PS4",
    "genre": "Action",
    "full_game": "Full Game",
    "game_info": "On August 19, 1839, a young man awakens in the dark and empty halls of the Prussian Brennenburg Castle with no memory about himself or his past.[2] All he can remember is that his name is Daniel, that he lives in Mayfair, and that something or someone is hunting him.[13][14] Shortly after regaining consciousness, Daniel finds a note written to himself, which informs him that he has deliberately erased his own memory and is being hunted by a \"Shadow\", an unearthly presence that manifests itself through fleshy, acidic growths spreading throughout the castle. The note instructs Daniel to descend into the Inner Sanctum of the castle in order to find and kill its baron, Alexander.  As he makes his way through the castle, Daniel gradually learns both about its mysteries and about his own past, through notes and diaries he finds as well as through sudden flashbacks and visions. The origin of his situation is a mysterious orb that he recovered from the Tin Hinan Tomb, which unleashed the Shadow. Each of the experts he contacted and consulted in person about the orb was later found gruesomely dismembered. Realizing that the Shadow was slowly stalking him, Daniel desperately exhausted all archaeological leads into strange orbs until contacted by Alexander, who promised a means of repelling the threat of the Shadow via a \"vitae\" energy, which could only be harvested from living creatures via extreme pain and terror. However, Alexander's true purpose is to use Daniel's vitae-enriched orb to return to his native dimension, from which he was banished centuries prior. To achieve this end, Alexander and Daniel gathered vitae by torturing innocent people that Alexander claimed to be murderous criminals.",
    "size": 30.45,
    "release_date": "2011-04-03",
    "developer": "Frictional Games",
    "rating": "https://compass-ssl.xbox.com/assets/88/d4/88d43eac-89d7-43c8-8aa7-eb67b02595c5.svg?n=ESRB-Mature_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 23,
  "fields": {
    "name": "Dishonoured",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/6/65/Dishonored_box_art_Bethesda.jpg/220px-Dishonored_box_art_Bethesda.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Stealth Action",
    "full_game": "Full Game",
    "game_info": "Dishonored is an action-adventure game played from a first-person perspective with an emphasis on stealth action and the use of gadgets and the environment to eliminate opposing forces.[1][2][3] The game world is a series of self-contained, mission-focused areas designed for multiple avenues of exploration in terms of in-game movement and powers.[2][4] Between missions, the player is taken to a central hub called the Hound Pits pub where the player character Corvo can meet with his allies, receive mission briefings and alternate objectives, and convert recovered loot into new equipment and upgrades.[4][5] In-game areas include loading docks, royal estates, poverty-stricken streets, and a bathhouse.[6] The player can save their progress anywhere, and the game includes a checkpoint save system. Saving is disabled during combat.[7][8] The game has four difficulty levels which modify the effectiveness of health and mana (magic) potions, and enemies' awareness, damage delivered, and responsiveness. In the easy setting, health regeneration is possible.[9]",
    "size": 34.98,
    "release_date": "2011-04-03",
    "developer": "Arkane Studios",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/220px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 24,
  "fields": {
    "name": "Fallout 4",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/7/70/Fallout_4_cover_art.jpg/220px-Fallout_4_cover_art.jpg",
    "price": 25.99,
    "platform": "PS4",
    "genre": "Action RPG",
    "full_game": "Full Game",
    "game_info": "The main story takes place in the year 2287, ten years after the events of Fallout 3 and 210 years after \"The Great War\", which caused catastrophic nuclear devastation across the United States. The player assumes control of a character referred to as the \"Sole Survivor\", who emerges from a long-term cryogenic stasis in Vault 111, an underground nuclear fallout shelter. After witnessing the murder of their spouse and kidnapping of their son, the Sole Survivor ventures out into the Commonwealth to search for their missing child. The player explores the game's dilapidated world, completes various quests, helps out factions, and acquires experience points to level up and increase the abilities of their character. New features to the series include the ability to develop and manage settlements and an extensive crafting system where materials scavenged from the environment can be used to craft drugs and explosives, upgrade weapons and armor, and construct, furnish and improve settlements. Fallout 4 also marks the first game in the series to feature full voice acting for the protagonist.",
    "size": 45.71,
    "release_date": "2015-05-19",
    "developer": "Bethesda",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/220px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 25,
  "fields": {
    "name": "The Outer Worlds",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/The_Outer_Worlds_cover_art.png/220px-The_Outer_Worlds_cover_art.png",
    "price": 25.99,
    "platform": "PS4",
    "genre": "Action RPG",
    "full_game": "Full Game",
    "game_info": "the Outer Worlds is an action role-playing video game featuring a first-person perspective. In the early stages of the game, the player can create their own character and unlock a ship, which acts as the game's central hub space. Though the player cannot control their ship directly, it serves as a fast travel point to access different areas in the game and acts as the player's persistent inventory space.[1] The player can encounter and recruit non-player characters as companions who have their own personal missions and stories. When accompanying the player, the companions act as an aid in combat. Each companion has their own individual skills and special attacks, and they can also develop their own skill specialization. When exploring, the player can bring up to two companions alongside them while the rest stay on the ship. The player can make numerous dialogue decisions which can influence the game's branching story. They can also respond to NPCs in various ways, such as acting heroically, maniacally, or moronically.",
    "size": 72.33,
    "release_date": "2019-10-25",
    "developer": "Obsidian",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/220px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 26,
  "fields": {
    "name": "Nier Automata",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/2/21/Nier_Automata_cover_art.jpg/220px-Nier_Automata_cover_art.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Action RPG",
    "full_game": "Full Game",
    "game_info": "Nier: Automata is an action role-playing game (RPG) in which players take the role of combat androids from the YoRHa units across an open world. In addition to standard navigation on foot, using a special item allows the player to summon a wild animal to ride, and in some scenarios pilot a flying mech to fight enemies.[3][4] As with Nier (2010), during navigation in some environments, the camera shifts from its standard third-person perspective to an overhead or side-scrolling view.[5] Some areas also include platforming elements, requiring the player to navigate by jumping between platforms or over obstacles. The player can complete side quests for non-playable characters (NPCs) found throughout the world. Shops available in hub locations allow the player to purchase items, including consumables that recover health.",
    "size": 67.99,
    "release_date": "2016-11-11",
    "developer": "Platinum Games",
    "rating": "https://image.api.playstation.com/grc/images/ratings/hd/esrb/e10.png?w=180&thumb=false",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 27,
  "fields": {
    "name": "Hitman 2",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/8/88/Hitman_2_%282018%29_cover.jpg/220px-Hitman_2_%282018%29_cover.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Stealth Action",
    "full_game": "Full Game",
    "game_info": "Hitman 2 is a 2018 stealth video game that was developed by IO Interactive and published by Warner Bros. Interactive Entertainment. It is the seventh major installment in the Hitman video game series, the sequel to 2016's Hitman and the second game in the World of Assassination trilogy. The game's story continues the plot arc started in Hitman and follows genetically-engineered assassin Agent 47, who is searching for the mysterious \"Shadow Client\" and his allies, who are trying to destroy Providence, a secretive organization that controls the world's affairs. Like the previous game in the series, Hitman 2, players can freely explore six large sandbox locations. Thye game also has online multiplayer modes called Sniper Assassin and Ghost mode, though the internet servers for these were shut down in August 2020.",
    "size": 34.76,
    "release_date": "2018-11-22",
    "developer": "IO Interactive",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 28,
  "fields": {
    "name": "Street Fighter V",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/8/80/Street_Fighter_V_box_artwork.png/220px-Street_Fighter_V_box_artwork.png",
    "price": 25.99,
    "platform": "PS4",
    "genre": "Fighting",
    "full_game": "Full Game",
    "game_info": "According to Capcom, the game was a PlayStation 4 console exclusive as both Sony and Capcom had \"the same vision for the growth potential in the fighting game space\". The game was powered by Unreal Engine 4, and had a beta test prior to its launch. Upon release, the game received mixed reviews, with critics praising the game's graphics and gameplay, but was criticized for its lack of content and characters, as well as its technical issues such as broken servers at launch and software bugs. Capcom was expecting the game to sell at least 2 million copies by the end of their fiscal year 2016. It missed the sales target, selling only 1.4 million copies as of March 31, 2016. As of September 30, 2021, its accumulated sales reached 6 million, making it the 2nd best selling Street Fighter game on home consoles according to Capcom's Platinum fiscal report",
    "size": 65.22,
    "release_date": "2016-03-24",
    "developer": "Capcom",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 29,
  "fields": {
    "name": "Streets of Rage 4",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d2/Streets_of_Rage_4.png/220px-Streets_of_Rage_4.png",
    "price": 15.99,
    "platform": "PS4",
    "genre": "Fighting",
    "full_game": "Full Game",
    "game_info": "Carrying on the style of gameplay from previous entries in the Streets of Rage series from the early 1990s, Streets of Rage 4 is a side-scrolling beat 'em up in which up to four players locally or two players online fight against waves of enemies, aided by disposable weapons and item pickups. Alongside standard attacks, throws, and Blitz Moves, each player character has a set of special attacks that can be performed at the cost of some health. In this game, however, players can restore health spent on a special attack by performing successive follow-up attacks without getting hit. Each player character also has unique super combo, \"Star Moves\", which can be performed by collecting Stars in each level. A new combo system is introduced, along with the ability to juggle opponents against walls and other players, allowing players to earn extra points by stringing together long combos without getting hit.",
    "size": 20.72,
    "release_date": "2019-01-25",
    "developer": "Dotemu",
    "rating": "https://image.api.playstation.com/grc/images/ratings/hd/esrb/e10.png?w=180&thumb=false",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 30,
  "fields": {
    "name": "Pillars Of Eternity",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/c/ca/Pillars_of_Eternity.jpg/220px-Pillars_of_Eternity.jpg",
    "price": 15.99,
    "platform": "PS4",
    "genre": "RPG",
    "full_game": "Full Game",
    "game_info": "Pillars of Eternity is a role-playing video game developed by Obsidian Entertainment and published by Paradox Interactive. It was released for Microsoft Windows, OS X, and Linux on March 26, 2015. The game is a spiritual successor to the Baldur's Gate and Icewind Dale series, along with Planescape: Torment. Obsidian started a crowdfunding campaign on Kickstarter for it in September 2012. The campaign raised over US$4 million, which was the highest funded video game at the time. The game uses the Unity engine.  The game takes place in the fantasy world of Eora, mainly inside the nation of Dyrwood. The infants in the Dyrwood are plagued by a recent phenomenon in which they become \"hollowborn\" upon birth, meaning they are born with no soul. During the beginning of the game, the protagonist experiences an awakening of power due to a disastrous supernatural event, discovering they are a \"Watcher\": a person who can see past lives and interact with souls. The objective of the game is to find out what caused their awakening and how to solve the hollowborn problem.",
    "size": 65.11,
    "release_date": "2015-05-19",
    "developer": "Obsidian",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/440px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 31,
  "fields": {
    "name": "Dark Souls",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/8/8d/Dark_Souls_Cover_Art.jpg/220px-Dark_Souls_Cover_Art.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Action RPG",
    "full_game": "Full Game",
    "game_info": "Dark Souls[b] is a 2011 action role-playing game developed by FromSoftware and published by Namco Bandai Games. A spiritual successor to FromSoftware's Demon's Souls, the game is the second instalment in the Souls series. Dark Souls takes place in the fictional kingdom of Lordran, where players assume the role of a cursed undead character who begins a pilgrimage to discover the fate of their kind. A port for Microsoft Windows was released in August 2012, which featured additional content not seen in the original PlayStation 3 and Xbox 360 versions. In October 2012, the new content was made downloadable for consoles under the subtitle Artorias of the Abyss.",
    "size": 40.53,
    "release_date": "2011-04-03",
    "developer": "From Software",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/440px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 32,
  "fields": {
    "name": "Invisible, Inc",
    "image": "https://cdn-products.eneba.com/resized-products/VqIBxK6rpPfRRKmx__3lN5r11YnKsTajFhw9amUPtT0_350x200_1x-0.jpg",
    "price": 15.99,
    "platform": "PS4",
    "genre": "Strategy",
    "full_game": "Full Game",
    "game_info": "The game is a turn-based tactics based-game inspired by X-COM,[1] with emphasis on stealth and espionage.[2] In each playthrough, the player takes on the role of an agent handler for covert operations and has three days to prepare for their final mission. This is done by performing various missions across the globe to retrieve information, valuables, equipment and personnel, keeping cognizant of the amount of time taken for travel and missions within that three day period.[1] The player selects two agents to perform these missions to start, and may be able to free other agents during missions; should one agent die during a mission, they remain dead for the remainder of the runthrough unless revived using a medkit consumable or dragged to the exit by another agent, while if all agents die, the game is over.",
    "size": 26.77,
    "release_date": "2017-02-28",
    "developer": "Klei Entertainment",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/ESRB_2013_Mature.svg/440px-ESRB_2013_Mature.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 33,
  "fields": {
    "name": "Ori and the Blind Forest",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/b/b2/Ori_and_the_Blind_Forest_Logo.jpg/220px-Ori_and_the_Blind_Forest_Logo.jpg",
    "price": 15.99,
    "platform": "PS4",
    "genre": "Action Platformer",
    "full_game": "Full Game",
    "game_info": "Ori and the Blind Forest is a 2D Metroidvania; a platform game with an emphasis on exploration, collecting items and upgrades, and backtracking to previously inaccessible areas. The player controls Ori, a white guardian spirit,[2] and Sein, who is the light and eyes of the Spirit Tree.[3] As Ori, players must jump, climb, and use various other abilities to navigate the game's world. Sein can shoot Spirit Flames to combat enemies or break obstacles. Ori is required to interact with the environment by jumping from platforms and solving puzzles, and is faced with various enemies. The player helps Ori collect health cells, energy cells, new abilities, and upgrades. The game world unfolds to the player in the fashion of a Metroidvania, with new abilities allowing the player to access previously inaccessible areas.",
    "size": 25.99,
    "release_date": "2018-01-26",
    "developer": "Moon Studios",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/ESRB_Everyone.svg/430px-ESRB_Everyone.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 34,
  "fields": {
    "name": "Ori and the Will of the Wisps",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/9/94/Ori_and_the_Will_of_the_Wisps.jpg/220px-Ori_and_the_Will_of_the_Wisps.jpg",
    "price": 25.99,
    "platform": "PS4",
    "genre": "Action Platformer",
    "full_game": "Full Game",
    "game_info": "Ori and the Will of the Wisps is a 2D Metroidvania; a platform game with an emphasis on exploration, collecting items and upgrades, and backtracking to previously inaccessible areas. The player controls the titular Ori, a white guardian spirit. As Ori, players must jump, climb, glide, and swim between various platforms to solve intricate puzzles. Gameplay unfolds in the form of a Metroidvania, with new abilities and upgrades allowing players to unlock previously inaccessible areas of the map. Some of the foundational gameplay elements were inspired by the Rayman and Metroid franchises.[7]  Unlike its predecessor Blind Forest, Will of the Wisps relies on autosaving rather than manually placed \"soul links\". The sequential upgrade system of the first title has been abandoned for a system of \"shards\" (inspired by the Final Fantasy series's \"materia\" system),[8] which can be purchased or found throughout the game to upgrade or modify Ori's stats and attacks. Ori's attacks can be managed via a convenient radial menu,[9] and orbs to increase Ori's health and energy can be found throughout the map.",
    "size": 30.99,
    "release_date": "2020-07-17",
    "developer": "Moon Studios",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/ESRB_Everyone.svg/430px-ESRB_Everyone.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 35,
  "fields": {
    "name": "A Hat in Time",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/2/2a/A_Hat_in_Time_cover_art.png/220px-A_Hat_in_Time_cover_art.png",
    "price": 15.99,
    "platform": "PS4",
    "genre": "Platformer",
    "full_game": "Full Game",
    "game_info": "A Hat in Time is a platform action-adventure game set in an open world environment and played from a third-person perspective. The gameplay style has been described by several editors to be similar to Nintendo 64 platformers such as Super Mario 64 and Banjo-Kazooie.[11][12] The player travels between four open levels (along with 2 extra levels via downloadable content), which can be freely explored without time limits. The player can collect various items, solve puzzles, and use an umbrella to combat enemies. The primary objective is to collect \"Time Pieces\", 56 of which can be found in the game, which unlock additional levels as more are collected.[13] After being defeated, the enemies drop \"Pons\", currency that can be used to unlock additional challenges and purchase badges that increase Hat Kid's abilities.",
    "size": 25.99,
    "release_date": "2016-03-24",
    "developer": "Gears for Breakfast",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/ESRB_Everyone.svg/430px-ESRB_Everyone.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 36,
  "fields": {
    "name": "Injustice 2",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/3/36/Injustice_2_Cover.jpg/220px-Injustice_2_Cover.jpg",
    "price": 35.99,
    "platform": "PS4",
    "genre": "Fighting",
    "full_game": "Full Game",
    "game_info": "njustice 2 is a fighting game in which players compete in one-on-one combat using characters from the DC Universe and other third-party franchises. Using different combinations of directional inputs and button presses, players must perform basic attacks, special moves, and combos to try to damage and knock out the opposing fighter.[3][4] Injustice 2 retains numerous gameplay mechanics from Injustice: Gods Among Us, including environment interaction, stage transitions, clashes, and character traits.[5][6][7] The trait system, like before, provides a temporary buff or ability that complements each character's playstyle.[5] The super meter, which allows players to execute enhanced special moves and unlock powerful \"super moves\" when fully charged, also returns.[8] Players can expend meter to perform new techniques, such as an evasive forward roll, which provides a way to overcome enemy keep-away tactics, or an air recovery, which lets characters escape an opponent's combo early.",
    "size": 45.82,
    "release_date": "2017-11-09",
    "developer": "NetherRealm Studios",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/ESRB_Everyone.svg/430px-ESRB_Everyone.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 37,
  "fields": {
    "name": "Dark Souls II",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/e/ed/Dark_Souls_II_cover.jpg/220px-Dark_Souls_II_cover.jpg",
    "price": 29.99,
    "platform": "PS4",
    "genre": "Action RPG",
    "full_game": "Full Game",
    "game_info": "The story of Dark Souls II begins with a human who has become Undead, cursed to never die and doomed to eventually become a Hollow, a zombie-like being with no memories or purpose. The protagonist is also known as the Bearer of the Curse. To break the curse, the undead travels to the fallen kingdom of Drangleic and is tasked by the Emerald Herald with obtaining four Great Souls from powerful Old Ones whose names are long forgotten and forbidden. Once obtained, the Emerald Herald directs the undead to \"Seek the King\" in the capital. After fighting through the remains of the royal guards, the player encounters the Queen Nashandra, who reveals that the king failed in his duty and fled his kingdom long ago. She asks the protagonist to slay the king.  Near the end of the Queen's quest, the player learns that the ruin of the kingdom was in fact caused by Nashandra. She came to the king and deceived him into launching an ill-fated invasion across the sea into the lands of the Giants. She coveted their souls and sought to steal their power. Though the raid succeeded in stealing the Giant's unspecified power, the Giants retaliated. Invading Drangleic, the Giants eventually destroyed the kingdom. With his kingdom in ruins, the king discovered Nashandra's true purpose and locked himself inside the Undead Crypt.",
    "size": 55.56,
    "release_date": "2013-05-12",
    "developer": "From Software",
    "rating": "https://www.esrb.org/wp-content/themes/esrb/assets/images/M.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 38,
  "fields": {
    "name": "Bloodstained: Ritual of the Night",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/7/74/Bloodstained_cover_art.jpg/220px-Bloodstained_cover_art.jpg",
    "price": 19.99,
    "platform": "PS4",
    "genre": "Action Platformer",
    "full_game": "Full Game",
    "game_info": "Bloodstained takes place in 18th century England during the Industrial Revolution. Fearing the loss of their influence over their wealthy patrons, the Alchemy Guild researched methods to summon demons and created Shardbinders, humans forcibly fused with demonically-charged crystals that attuned them to their powers. These Shardbinders were sacrificed by the Guild to summon demons from Hell in what was meant to be a scare tactic but instead brought uncontrollable destruction that wiped out the Guild and much of England until the Church was able to banish them. Of the sacrificed Shardbinders, only one named Gebel survived. Another Shardbinder, the main protagonist Miriam, is spared due to falling into an unnatural slumber before she can be sacrificed.[1]  Ten years later in the game's present-day, Miriam has awakened from her slumber and has learned that Gebel has summoned the demons to destroy England as he seeks revenge on the surviving alchemists for what they did to him.[2] Accompanied by Johannes, a former member of the Alchemy Guild, they sail across the ocean to Arvantville, a destroyed village on the outskirts of Gebel's castle, the Hellhold. They meet with Johannes's friend Dominique, an exorcist who helped Johannes care for Miriam during her slumber and has been sent by the Church to help them stop Gebel.",
    "size": 64.23,
    "release_date": "2018-07-09",
    "developer": "ArtPlay",
    "rating": "https://compass-ssl.xbox.com/assets/35/ee/35eef92e-13d8-407d-905c-294e25988f4f.svg?n=ESRB-T_500x500.svg",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 39,
  "fields": {
    "name": "Dead Cells",
    "image": "https://assets1.ignimgs.com/2019/06/10/dead-cells---button-fin-1560125633132.jpg?width=300",
    "price": 24.99,
    "platform": "PS4",
    "genre": "Action Platformer",
    "full_game": "Full Game",
    "game_info": "Dead Cells is described as a \"roguevania\", a combination of procedurally-generated roguelike games and action-exploration-based Metroidvania games.[4] The player controls a mass of cells that occupy and control the body of a deceased prisoner at the start of each game. As they explore a series of dungeons and fight the creatures within, they collect weapons, skins, abilities, power-ups, and money. Enemies will sometimes drop cells when defeated, which can be used to obtain permanent power-ups such as additional health potions or items that can be bought or found in later runs.[5] These cells must be spent at the end of a dungeon section; if a player dies before then, they lose all collected cells.",
    "size": 25.83,
    "release_date": "2018-11-22",
    "developer": "Motion Twin",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/ESRB_Teen.svg/430px-ESRB_Teen.svg.png",
    "is_official": true
  }
},
{
  "model": "games.games",
  "pk": 40,
  "fields": {
    "name": "Hades",
    "image": "https://upload.wikimedia.org/wikipedia/en/thumb/c/cc/Hades_cover_art.jpg/220px-Hades_cover_art.jpg",
    "price": 24.99,
    "platform": "PS4",
    "genre": "RPG",
    "full_game": "Full Game",
    "game_info": "Zagreus, the son of Hades, seeks to escape his father's realm in the Underworld. He is aided by his adoptive mother Nyx, who gives him a special mirror that empowers him with various abilities via collected Darkness; the Gods of Olympus to whom he has reached out, who provide him with Boons that give him special powers, and his mentor Achilles, who provides him with the Infernal Arms, weapons that possess powerful and hidden aspects of their past, present, and future wielders. Hades hinders Zagreus' progress by unleashing the Underworld's various residents on him, including the Fury Megaera, Zagreus' ex-lover (and later on her sisters Alecto and Tisiphone); a Lernean Bone Hydra; the legendary Theseus alongside his new partner Asterius, and finally Hades himself.  It is eventually revealed that Zagreus wishes to escape the Underworld to find Persephone, his birth mother whom he never knew, having always been told he was the child of Nyx. Hades refuses to even allow her name to be spoken in his House and it is said that unimaginable punishment should befall anyone who disobeys his order. Nyx, on the other hand, decides to help Zagreus find the truth about his real mother for himself by putting him in contact with his relatives on Olympus. After finally defeating Hades for the first time, Zagreus finds Persephone in Greece. After a tearful reunion, Zagreus discovers that since he is bound to the Underworld like his father, he cannot survive long on the surface. Despite this, he promises to keep escaping to spend time with Persephone and learn the truth of her absence.",
    "size": 34.99,
    "release_date": "2018-12-04",
    "developer": "Supergiant Games",
    "rating": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/be/ESRB_Teen.svg/430px-ESRB_Teen.svg.png",
    "is_official": true
  }
}
]
